app/views/profiles/show.html.erb

SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = 1
SELECT COUNT(*) FROM "posts" WHERE "posts"."user_id" = 1
---
  <div class="mt-6">
    <h1 class="text-sm text-gray-500"><%= @user.posts.count %> Posts</h1>

SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = 1
---
    <div class="grid grid-cols-1 sm:grid-cols-2 lg:grid-cols-3 gap-6">
      <% @user.posts.each do |post| %>