app/views/users/index.html.erb

    <% @users.each do |user| %>
      <% if user.posts.any? %>
---
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" IN (1, 2)

                  <h5 class="text-lg font-semibold text-gray-900 mb-4">Comments</h5>
                  <% if post.comments.any? %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = 2