app/views/users/show.html.erb

SELECT 1 AS one FROM "users" WHERE "users"."username" LIKE '%sh%' AND "users"."id" != 1 LIMIT 1
---
      <% @users.each do |user| %>
        <% if user.username.present? %>

SELECT "friend_requests".* FROM "friend_requests" WHERE "friend_requests"."sender_id" = 3 AND "friend_requests"."receiver_id" = 1 AND "friend_requests"."status" IN (0, 1) LIMIT 1
---
              <%= f.hidden_field :receiver_id, value: user.id %>
              <% existing_request = FriendRequest.find_by(
                  sender: current_user,
                  receiver: user,
                  status: [:pending, :accepted]
                ) %>