app/views/posts/index.html.erb

              <h5 class="text-lg font-semibold text-gray-900 mb-4">Comments</h5>
              <% if post.comments.any? %>
                <ul class="space-y-4">
                  <% post.comments.each do |comment| %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = 2
SELECT 1 AS one FROM "comments" WHERE "comments"."post_id" = 1 LIMIT 1

                <h5 class="text-lg font-semibold text-gray-900 mb-4">Comments</h5>
                <% if post.comments.any? %>
---
SELECT 1 AS one FROM "comments" WHERE "comments"."post_id" = 3 LIMIT 1