app/views/posts/show.html.erb

          <div class="divide-y">
            <% @post.comments.order(created_at: :desc).each do |comment| %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = 1 ORDER BY "comments"."created_at" DESC