app/controllers/comments_controller.rb

INSERT INTO "comments" ("content", "user_id", "post_id", "created_at", "updated_at") VALUES ('dfs', 5, 2, '2025-02-11 04:37:47.317381', '2025-02-11 04:37:47.317381') RETURNING "id"
---
  def create
    @comment = @post.comments.new(comment_params)
    @comment.user = current_user
    if @comment.save

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = 2 AND "comments"."id" = 1 LIMIT 1
DELETE FROM "comments" WHERE "comments"."id" = 1
---
  def destroy
    @comment = @post.comments.find(params[:id])
    @comment.destroy