app/controllers/friend_requests_controller.rb

  def create
    receiver = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = 3 LIMIT 1