app/controllers/friend_requests_controller.rb

INSERT INTO "friend_requests" ("sender_id", "receiver_id", "status", "created_at", "updated_at") VALUES (1, 2, 0, '2025-02-10 18:42:44.553722', '2025-02-10 18:42:44.553722') RETURNING "id"
---
  def create
    @friend_request = current_user.sent_friend_requests.build(friend_request_params)
    if @friend_request.save

SELECT "friend_requests".* FROM "friend_requests" WHERE "friend_requests"."id" = 6 LIMIT 1
UPDATE "friend_requests" SET "status" = 1, "updated_at" = '2025-02-10 19:15:14.476789' WHERE "friend_requests"."id" = 6
---
  def accept
    @friend_request = FriendRequest.find(params[:id])
    if @friend_request.receiver == current_user
      @friend_request.update(status: :accepted)

SELECT "friend_requests".* FROM "friend_requests" WHERE "friend_requests"."id" = 1 LIMIT 1
DELETE FROM "friend_requests" WHERE "friend_requests"."id" = 1
---
  def destroy
    @friend_request = FriendRequest.find(params[:id])
    if @friend_request.receiver == current_user
      @friend_request.destroy