app/controllers/likes_controller.rb

  def create
    @like = @post.likes.find_by(user: current_user)
    if @like
      @like.destroy
    else
      @post.likes.create(user: current_user)
---
SELECT "likes".* FROM "likes" WHERE "likes"."post_id" = 2 AND "likes"."user_id" = 5 LIMIT 1
DELETE FROM "likes" WHERE "likes"."id" = 1
INSERT INTO "likes" ("user_id", "post_id", "created_at", "updated_at") VALUES (5, 2, '2025-02-11 04:37:40.322305', '2025-02-11 04:37:40.322305') RETURNING "id"