app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."user_id" IN (2, 3, 4) ORDER BY "posts"."created_at" DESC
---
    def index
      friends = current_user.friends
      if friends.any?
        @posts = Post.where(user_id: friends.pluck(:id)).order(created_at: :desc)
      else
        @posts = Post.order("RANDOM()").limit(10)

INSERT INTO "posts" ("user_id", "caption", "image", "created_at", "updated_at") VALUES (5, 'sdnfks', NULL, '2025-02-11 03:31:14.439204', '2025-02-11 03:31:14.439204') RETURNING "id"
---
  def create
    @post = current_user.posts.build(post_params)
    if @post.save

UPDATE "posts" SET "updated_at" = '2025-02-11 18:32:26.735993' WHERE "posts"."id" = 4
---
  def update
    if @post.update(post_params)