app/controllers/profiles_controller.rb

  def show
    @user = User.find(params[:id])

    # Check if current_user is friends with @user
    if current_user.friends.include?(@user)
---
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
SELECT 1 AS one FROM "users" WHERE "users"."id" IN (3, 4) AND "users"."id" = 2 LIMIT 1