app/controllers/users_controller.rb

  def index
    @users = User.includes(posts: :comments).all
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = 2
SELECT "users".* FROM "users"