app/models/user.rb

  def friends
    sent_friends = FriendRequest.where(sender_id: id, status: "accepted").pluck(:receiver_id)
    received_friends = FriendRequest.where(receiver_id: id, status: "accepted").pluck(:sender_id)
    User.where(id: sent_friends + received_friends)
---
SELECT "friend_requests"."sender_id" FROM "friend_requests" WHERE "friend_requests"."receiver_id" = 1 AND "friend_requests"."status" = 1
SELECT "users".* FROM "users" WHERE (lower(email) = 'hitesh@gmail.com' OR phone = 'hitesh@gmail.com') ORDER BY "users"."id" ASC LIMIT 1

  def self.find_for_database_authentication(warden_conditions)
    conditions = warden_conditions.dup
    login = conditions.delete(:login)
    where(conditions).where(["lower(email) = :value OR phone = :value", { value: login.downcase }]).first
---
SELECT "users".* FROM "users" WHERE (lower(email) = 'test@gmail.com' OR phone = 'test@gmail.com') ORDER BY "users"."id" ASC LIMIT 1

  def self.pick_random
    count = User.count
    return nil if count == 0
    random_offset = rand(count)
    random_user = User.offset(random_offset).first
---
SELECT COUNT(*) FROM "users"
SELECT "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT 1 OFFSET 3