app/controllers/users/sessions_controller.rb

SELECT "users".* FROM "users" WHERE (lower(email) = 'hitesh@gmail.com' OR phone = 'hitesh@gmail.com') ORDER BY "users"."id" ASC LIMIT 1
---
  def create
    self.resource = User.find_for_database_authentication(login: params[:user][:login])